Tekla Open API Reference for Tekla Structures 2025
Mark.MarkAttributes.Content Property
 The mark content as a list of elements.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ContainerElement Content { get; set; }
Public Property Content As ContainerElement
	Get
	Set
Property Value
Type: ContainerElement
See Also
Reference
Mark.MarkAttributes Class
Tekla.Structures.Drawing Namespace